[{
    "Id": 1,
    "RecipeName": "Masala Karela",
    "Ingredients": "6 Karela (Bitter Gourd/ Pavakkai) - deseeded,Salt - to taste,1 Onion - thinly sliced,3 tablespoon Gram flour (besan),2 teaspoons Turmeric powder (Haldi),1 tablespoon Red Chilli powder,2 teaspoons Cumin seeds (Jeera),1 tablespoon Coriander Powder (Dhania),1 tablespoon Amchur (Dry Mango Powder),Sunflower Oil - as required",
    "PrepTime": 15,
    "CookTime": 30,
    "TotalTime": 45,
    "Servings": 6,
    "Cuisine": "Indian",
    "Course": "Side Dish",
    "Diet": "Diabetic Friendly",
    "Instructions": "To begin making the Masala Karela Recipe,de-seed the karela and slice. Do not remove the skin as the skin has all the nutrients. Add the karela to the pressure cooker with 3 tablespoon of water, salt and turmeric powder and pressure cook for three whistles. Release the pressure immediately and open the lids. Keep aside.Heat oil in a heavy bottomed pan or a kadhai. Add cumin seeds and let it sizzle.Once the cumin seeds have sizzled, add onions and saute them till it turns golden brown in color.Add the karela, red chilli powder, amchur powder, coriander powder and besan. Stir to combine the masalas into the karela.Drizzle a little extra oil on the top and mix again. Cover the pan and simmer Masala Karela stirring occasionally until everything comes together well. Turn off the heat.Transfer Masala Karela into a serving bowl and serve.Serve Masala Karela along with Panchmel Dal and Phulka for a weekday meal with your family. ",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/1-Masala_Karela.jpeg"
},
{
    "Id": 2,
    "RecipeName": "Spicy Tomato Rice",
    "Ingredients": "2-1 / 2 cups rice - cooked, 3 tomatoes, 3 teaspoons BC Belle Bhat powder, salt - as per taste, 1 teaspoon chickpea lentils, 1/2 teaspoon cumin seeds, 1 teaspoon white urad dal, 1/2 Teaspoon mustard, 1 green chilli, 1 dry red chilli, 2 teaspoon cashew - or peanuts, 1-1 / 2 tablespoon oil - 1/2 teaspoon asafoetida",
    "PrepTime": 5,
    "CookTime": 10,
    "TotalTime": 15,
    "Servings": 3,
    "Cuisine": "South Indian Recipes",
    "Course": "Main Course",
    "Diet": "Vegetarian",
    "Instructions": "To make tomato puliogere, first cut the tomatoes. Now put in a mixer grinder and puree it. Now heat oil in a pan. After the oil is hot, add chana dal, urad dal, cashew and let it cook for 10 to 20 seconds. After 10 to 20 seconds, add cumin seeds, mustard seeds, green chillies, dry red chillies and curry leaves. After 30 seconds, add tomato puree to it and mix. Add BC Belle Bhat powder, salt and mix it. Allow to cook for 7 to 8 minutes and then turn off the gas. Take it out in a bowl, add cooked rice and mix it. Serve hot. Serve tomato puliogre with tomato cucumber raita and papad for dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/2-Spicy_Tomato_Rice.jpeg"
},
{
    "Id": 3,
    "RecipeName": "Ragi Semiya Upma - Ragi Millet Vermicelli Breakfast",
    "Ingredients": "1-1/2 cups Rice Vermicelli Noodles (Thin),1 Onion - sliced,1/2 cup Carrots (Gajjar) - chopped,1/3 cup Green peas (Matar),2 Green Chillies,1/4 teaspoon Asafoetida (hing),1 teaspoon Mustard seeds,1 teaspoon White Urad Dal (Split),1 teaspoon Ghee,1 sprig Curry leaves,Salt - to taste,1 teaspoon Lemon juice",
    "PrepTime": 20,
    "CookTime": 30,
    "TotalTime": 50,
    "Servings": 4,
    "Cuisine": "South Indian Recipes",
    "Course": "South Indian Breakfast",
    "Diet": "High Protein Vegetarian",
    "Instructions": "To begin making the Ragi Vermicelli Recipe, first steam the ragi vermicelli in a rice cooker or a steamer for about 5-6 minutes or till it is cooked but firm.Keep aside this aside till later use. You can add a few drops of oil and mix it so that they don't stick to each other.Place a kadai on the heat, add the ghee or oil to it and when warm add hing and allow it to sizzle for 30 seconds. Then follow it up with mustard seeds, urad dal and curry leaves, and allow them to crackle.Saute for 1 minute or so till the urad dal is slightly browned.Then, add onions and fry till translucent and soft.Next, add the green chillies along with par boiled carrots and peas. Sprinkle some salt and cook for 2-3 minutes or until the vegetables are semi cooked.Then, add the steamed ragi vermicelli toss it together so the vegetables are all well combined.Switch off the heat, take the vermicelli out into a serving dish and to with lemon juice. Mix well and serve along with Coconut Chutney and a hot cup of coffee or tea for a wholesome breakfast.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/3-Ragi_Semiya_Upma.jpeg"
},
{
    "Id": 4,
    "RecipeName": "Gongura Chicken Curry - Andhra Style Gongura Chicken",
    "Ingredients": "500 grams Chicken,2 Onion - chopped,1 Tomato - chopped,4 Green Chillies - slit,1 inch Ginger - finely chopped,6 cloves Garlic - finely chopped,1/2 teaspoon Turmeric powder (Haldi),1 teaspoon Garam masala powder,2 tablespoon Sesame (Gingelly) Oil,Salt - to taste,1/4 teaspoon Methi Seeds (Fenugreek Seeds),1 tablespoon Coriander (Dhania) Seeds,4 Dry Red Chillies,1 teaspoon Fennel seeds (Saunf),1 teaspoon Sesame (Gingelly) Oil,4 cloves Garlic,2 cups Sorrel Leaves (Gongura) - picked and chopped,Salt - to taste",
    "PrepTime": 15,
    "CookTime": 30,
    "TotalTime": 45,
    "Servings": 4,
    "Cuisine": "Andhra",
    "Course": "Lunch",
    "Diet": "Non Vegeterian",
    "Instructions": "To begin making Gongura Chicken Curry Recipe first prep all the ingredients and keep them aside.In a small pan, dry roast the methi seeds, coriander seeds, fennel seeds and red chillies for about 3 to 4 minutes on medium heat, until you notice the seeds crackling. Once done, turn off the heat and allow it to cool a bit and blend it into a smooth powder.Heat oil in a pressure cooker over medium heat; add the chopped onions, ginger, garlic and green chillies and saute until the onions are lightly browned and tender.Add the tomatoes, and saute until the tomatoes become soft and mushy. Once done add the chicken, the garam masala and turmeric powder. Add 1/4 cup of water and pressure cook the chicken for 3 to 4 whistles and turn off the heat.Once done, allow the pressure to release naturally.Make sure there are no stems when you pick the gongura leaves. Wash and chop the gongura leaves and keep aside.In another pan,add some oil along garlic and saute the chopped gongura leaves along with a little salt and the ground masala. The gongura leaves will wilt almost instantly. Saute the gongura in the masala for about 3 to 4 minutes until it becomes like a mushy paste.Once done, add the cooked chicken curry into the Gongura masala and saute on high heat for another 2 minutes and turn off the heat.Check the salt and spices and adjust according to taste. Transfer the Gongura Chicken Curry to a serving bowl and serve hot.Serve Gongura Chicken with Ghee Rice Recipe | Neychoru , Tomato Onion Cucumber Raita Recipe and a Semiya Payasam for a delicious weekend lunch.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/4-Gongura_Chicken_Curry.jpeg"
},
{
    "Id": 5,
    "RecipeName": "Andhra Style Alam Pachadi - Adrak Chutney",
    "Ingredients": "1 tablespoon chana dal, 1 tablespoon white urad dal, 2 red chillies, 1 tablespoon coriander seeds, 3 inches ginger - chop, 1 onion - chop, 1 tomato - chop, salt - as per taste, 1 Teaspoon mustard, asafoetida - a pinch, oil - as per use, 1 sprig curry",
    "PrepTime": 10,
    "CookTime": 20,
    "TotalTime": 30,
    "Servings": 4,
    "Cuisine": "Andhra",
    "Course": "South Indian Breakfast",
    "Diet": "Vegetarian",
    "Instructions": "To make Andhra Style Alam Pachadi, first heat oil in a pan. Add lentils and cook till it turns brown. Now add dry red chillies, coriander seeds, onion, ginger and cook till the onion becomes soft. After the onion is cooked, add tomatoes and cook till the tomatoes become soft. Turn off the gas and allow it to cool. After it cools down, put it in a mixer grinder and make a paste. For tempering, heat the oil in a small pan. Add mustard seeds and let it cook for 10 seconds. Now add curry leaves, asafoetida and let it cook for 10 seconds. Add it to the chutney and mix. Serve Andhra Style Alam Pachadi with Ghee Roast Dosa and Kirai Sambar for breakfast.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/5-Andhra_Style_Alam_Pachadi.jpeg"
},
{
    "Id": 6,
    "RecipeName": "Pudina Khara Pongal (Rice and Lentils Cooked With Mint Leaves & Mild Spices)",
    "Ingredients": "1 cup Rice - soaked for 20 minutes,1/2 cup Yellow Moong Dal (Split) - soaked for 20 minutes,1 cup Mint Leaves (Pudina) - tightly packed,1/4 cup Coriander (Dhania) Leaves - tightly packed,1 Green Chilli,1 inch Ginger,1 teaspoon Cumin seeds (Jeera),5 cups Water,1 teaspoon Sunflower Oil,Salt - to taste,2 tablespoons Ghee,8 Cashew nuts - halved,1 teaspoon Cumin seeds (Jeera),1 teaspoon Whole Black Peppercorns,1 sprig Curry leaves,1 pinch Asafoetida (hing)",
    "PrepTime": 10,
    "CookTime": 20,
    "TotalTime": 30,
    "Servings": 4,
    "Cuisine": "South Indian Recipes",
    "Course": "South Indian Breakfast",
    "Diet": "High Protein Vegetarian",
    "Instructions": "To begin making Pudina Khara Pongal Recipe, wash and soak the rice and dal for 20 minutes.Make a paste of mint/pudina, coriander, green chilli and ginger using a mixer grinder and keep aside.Now, heat oil in the pressure cooker, add the cumin seeds and let it crackle.Add the soaked rice and dal and fry for a few minutes.Add the mint coriander paste and saute for a minute.Add 5 cups of water, season with salt and pressure cook for 4 to 5 whistles and keep aside.In the mean prepare the tadka by heating ghee in a small tadka pan.Add in the cumin seeds, peppercorns and let it crackle.Add the cashew halves and fry till they turn golden.Add the curry leaves and asafoetida and turn off the flame.Once the pressure has been released, open the lid and mash the pongal mixture.Add in the tadka over it and Serve the Pudina Khara Pongal Recipe along with Kathirikai Gothsu Recipe (Spicy and Tangy Eggplant Curry)and South Indian Coconut Chutney for a relaxed weekend breakfast.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/6-Pudina_Khara_Pongal.jpeg"
},
{
    "Id": 7,
    "RecipeName": "Udupi Style Ash Gourd Coconut Curry",
    "Ingredients": "500 grams Vellai Poosanikai (Ash gourd/White Pumpkin),1/2 teaspoon Turmeric powder (Haldi),Salt - to taste,Sunflower Oil - for cooking,4 Dry Red Chillies,1/2 cup Fresh coconut - grated,30 grams Tamarind Water,1/2 teaspoon Methi Seeds (Fenugreek Seeds),1/2 teaspoon Cumin seeds (Jeera),2 teaspoons Coriander (Dhania) Seeds,2 teaspoons Sesame seeds (Til seeds),3 tablespoons Jaggery,1 cup Tamarind Water,1 teaspoon Sunflower Oil,1/2 teaspoon Mustard seeds,2 sprig Curry leaves - roughly torn,1 Dry Red Chillies",
    "PrepTime": 10,
    "CookTime": 30,
    "TotalTime": 40,
    "Servings": 4,
    "Cuisine": "Udupi",
    "Course": "Lunch",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Udupi Style Ash Gourd Coconut Curry Recipe  cook the ash gourd in the pressure cooker with little water, turmeric powder and salt for just 1 whistle. Release the pressure naturally.Soak the tamarind ball in hot water for about 15 minutes, and squeeze and keep the water.Then dry roast the spices and other ingredients for the ground paste in a pan except the coconut. Then grind it along with coconut to a smooth paste.In same pressure cooker which has the ash gourd add the paste and little water and give it stir. Keep the Udupi Ash Gourd Coconut Curry on the medium heat, Adjust the seasoning and texture if required. Once done transfer it in a bowl.For the seasoning, heat oil in a small skillet and add mustard seeds and let it crackle. After the mustard seeds have crackled add the curry leaves and red chillies. Tun off the heat after the red chillies have darkened and add it on top of the Udupi Style Ash Gourd Coconut Curry and serve. Serve the Udupi Style Ash Gourd Coconut Curry Recipe along with steamed rice, Elai Vadam  and Pisarna Manga for lunch.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/7-Udupi_Style_Ash_Gourd_Coconut_Curry.jpeg"
},
{
    "Id": 8,
    "RecipeName": "Mexican Style Black Bean Burrito",
    "Ingredients": "4 Tortillas,1/4 cup Black beans - soaked overnight and  cooked,6 to 8 Spinach Leaves (Palak),1 Onion - chopped,1 Tomato - chopped,2 cloves Garlic - chopped,2 sprig Coriander (Dhania) Leaves,1 cup Rice - or brown rice,1 Lemon juice,4 Spring Onion Greens - chopped,4 tablespoons Cheddar cheese,4 tablespoon Hung Curd (Greek Yogurt)",
    "PrepTime": 10,
    "CookTime": 30,
    "TotalTime": 40,
    "Servings": 4,
    "Cuisine": "Mexican",
    "Course": "Lunch",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Black Bean Burrito recipe, pick the coriander leaves and set aside, then finely slice the stalks.Keep it aside.Heat 1 tablespoon of oil in a heavy bottomed pan over a medium heat, add the chopped garlic and coriander stalks and fry till they become brown.Add the cooked beans, mix it well and cook for a minute. Add the rice and cook for further 5 minutes. Remove from the heat and add coriander leaves that were kept aside. For Salsa, toss together tomatoes, onions, spring onions, lime juice, coriander leaves, mix well using a fork and season to taste.Heat the tortillas on a griddle pan till it softens. Lay it on a plate.Layer spinach leaves over the  tortilla. Spoon one-quarter of the fried rice and beans, top with a generous spoonful of salsa.Grate over some cheese and add a spoon of yoghurt. Wrap up the burrito, then tuck it in.Repeat with the remaining ingredients to make the rest of the burritos. Serve Black Bean Burrito with a side of chips and a healthy Green Apple, Radish & Pepper Salad  and a glass of Carrot Pineapple Orange Juice Recipe to make a delicious lunch or dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/8-Mexican_Style_Black_Bean_Burrito.jpeg"
},
{
    "Id": 9,
    "RecipeName": "Spicy Crunchy Masala Idli",
    "Ingredients": "10 Idli - cut into strips,1 cup Green Bell Pepper (Capsicum) - thinly sliced,1 cup Tomato - finely chopped,1 cup Onions - finely chopped,2 Green Chillies - finely chopped,1/4 teaspoon Red Chilli powder,1/2 teaspoon Turmeric powder (Haldi),3 tablespoons Tomato Ketchup,Coriander (Dhania) Leaves - to taste,Mint Leaves (Pudina) - to taste,2 teaspoons Sunflower Oil,Salt - to taste",
    "PrepTime": 10,
    "CookTime": 20,
    "TotalTime": 30,
    "Servings": 3,
    "Cuisine": "South Indian Recipes",
    "Course": "Snack",
    "Diet": "Vegetarian",
    "Instructions": "To prepare Spicy Crunchy Masala Idli Recipe, Heat a tablespoon of oil in a heavy bottomed pan and stir fry them until they are lightly crisp. Transfer to a bowl and keep aside.In 2 teaspoons of oil the same pan; add in the onions, capsicum, green chillies and saute them on medium heat until tender. This takes about 5 to 7 minutes.  Add in the chopped tomatoes, salt, pepper, turmeric powder, chilli powder and stir well. Saute until the tomatoes turn soft. Finally stir in the tomato ketchup, the fried idli's the chopped coriander and mint leaves. Stir fry on high heat until well combined just for about a minute.Turn off the heat and transfer the Spicy Crunchy Masala Idli Recipe to a serving bowl and serve hot topped with more date chutney or tomato ketchup.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/9-Spicy_Crunchy_Masala_Idli.jpeg"
},
{
    "Id": 10,
    "RecipeName": "Cauliflower Leaves Chutney",
    "Ingredients": "1 cup cabbage leaves, 3/4 cup tomatoes, 18 grams tamarind, 2 tablespoons white urad dal, 4 red chillies, salt - as per taste, asafoetida - a pinch, 3 cloves garlic, turmeric powder - a pinch, 1 big Spoon oil, 1 teaspoon Rye, 1/2 teaspoon Cumin seeds, 1 sprig Curry leaves",
    "PrepTime": 5,
    "CookTime": 20,
    "TotalTime": 25,
    "Servings": 3,
    "Cuisine": "South Indian Recipes",
    "Course": "Side Dish",
    "Diet": "Vegetarian",
    "Instructions": "To make cauliflower leaf chutney, first of all take out the leaf inside the cabbage and wash it well. Dry and cut it well. Heat the oil in a pan. Add urad dal, dry red chilli and cook till the dal turns golden. Keep it aside. Add some more oil to the same pan. Add cabbage leaves, salt and cook till the leaves become soft. Now add tomatoes, garlic and mix well. Cook until tomatoes are soft. After cooking, turn off the gas and allow this mixture to cool. Pour it into a mixer grinder with the dal mixture and grind it. Add some water and salt and grind it once more. For tempering, add mustard seeds to a tempering pan. After 10 seconds, add cumin, asafoetida and curry leaves. After 15 seconds, add it to the chutney and mix. Serve Cabbage Leaves Chutney with Vegetable Sambar and Rice for dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/10-Cauliflower_Leaves_Chutney.jpeg"
},
{
    "Id": 11,
    "RecipeName": "Homemade Baked Beans (Wholesome & Healthy)",
    "Ingredients": "250 grams Dry beans - (such as cannellini or soya beans),1 teaspoon Extra Virgin Olive Oil,1 Onion - finely chopped,1 clove Garlic - grated,500 grams Tomatoes - pureed,1 tablespoon Honey - or more to taste,1 teaspoon Cumin powder (Jeera),1 teaspoon Dried oregano,1/4 teaspoon Red Chilli powder - or cayenne pepper,Salt and Pepper - (coarsely pounded pepper) to taste",
    "PrepTime": 60,
    "CookTime": 60,
    "TotalTime": 120,
    "Servings": 4,
    "Cuisine": "Fusion",
    "Course": "High Protein Vegetarian",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the homemade baked beans recipe, we first have to soak the beans overnight for about 8 hours in water.We also have to make the cooked tomato puree. Click here to see the recipe of how to make tomato puree at home.Once the beans are soaked well, our next step is to cook them. I like using the pressure cooker method to cook the beans. Place the beans in the pressure, place the weight on, cover the pan and cook it along with 2-1/2 cups of water. After you heat 4 to 5 whistles, turn the heat to low and cook for another 15 minutes.Turn off the heat and allow the pressure cooker to release its pressure naturally. This would take another 10 minutes. The beans continue to cook under the pressure even when it is turned off.Once the pressure is released, open the cooker and drain out the excess liquids. You store this liquid and use it in the vegetable stock or risotto.Once the beans are cooked, our next step is to spice it up to make the baked beans.Heat oil in a sauce pan on medium heat; add in the onions and garlic and give it a light sauté until the onions are tender. Add the tomatoes, honey and the spices and give it a stir.Add in the cooked drained beans into the tomato gravy. Stir fry the beans until the beans get well coated with the tomatoes. Cover the pan, turn the heat to low and simmer the beans for about 30 minutes until you noticed the beans are well coated with the spices and tomatoes. Check the salt and seasoning levels and adjust to suit your taste.You can optionally garnish the Homemade Baked Beans with coriander leaves and serve it along with toast, or Potato Cakes Recipe.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/11-Homemade_Baked_Beans.jpeg"
},
{
    "Id": 12,
    "RecipeName": "Veg Chili Cheese Burgers",
    "Ingredients": "2 Burger buns,5 Pickled Jalapenos - sliced,2 Cheese Slices,2 Potatoes (Aloo) - pressure cooked,1 Onion - chopped,1 tablespoon Red Chilli powder,Salt - to taste,1 Whole Egg,1/2 cup Whole Wheat Bread crumbs,4 cloves Garlic - chopped,1 Onions - chopped,2 Tomatoes - chopped,1 cup Homemade tomato puree,1 Green Bell Pepper (Capsicum) - chopped,1/2 cup Soy granules,1 tablespoon Red Chilli powder,1 teaspoon Red Chilli flakes,1 tablespoon Cumin powder (Jeera),1 tablespoon Dried oregano,1 tablespoon Tabasco Original - Hot Sauce,1 teaspoon Honey,Salt - to taste,Sunflower Oil",
    "PrepTime": 10,
    "CookTime": 45,
    "TotalTime": 55,
    "Servings": 4,
    "Cuisine": "Continental",
    "Course": "Main Course",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Veg Chili Cheese Burgers Recipe, we will first pressure cook the potatoes and keep it ready. Cook them for 5 whistles in a pressure cooker. Once done allow the pressure to release naturally and peel off the skin. Add them into a bowl and mash it using a potato masher.Add onions, salt and red chilli powder and bind it together. Shape them into medium sized cutlets and leave it in the fridge to rest until you move on to make the sauce.To make the sauce, heat a flat skillet with oil on medium heat, add garlic and allow it soften for few seconds.Add chopped onions and saute until they turn golden brown. Add chopped capsicum and saute for a few minutes. Add in chopped tomatoes and sprinkle with a bit of salt and saute till they turn mushy. Also add in the tomato puree and all the seasonings like, red chilli powder, cumin powder, red chilli flakes, dried oregano, tobacco sauce and honey.Keep sautéing until the tomatoes are cooked, you will notice the tomatoes will change color and the raw smell goes away.At the end add the soya granules and salt to taste. Add about 1/4 cup of water and allow it to boil for 4-6 minutes minutes. Let the sauce be little gravish.Switch off the heat, heat a flat skillet for the patties to shallow fry them. Take the patties out of the fridge. Beat an egg into a bowl and also keep the bread crumbs ready over a plate.Carefully dip the patties into the egg and place them over the bread crumbs and coat them well on either side Dust off the excess bread crumbs.Place the crumb dipped patties on to the hot skillet and drizzle some oil on top. Cook on either side for atleast 10 minutes. Till you can see brown color crispy layer on top.Do the same for the rest of the patties and set aside.Once done, add a tablespoon of butter on the same skillet and cut the burger bun in to half horizontally and toast them on the tawa. Toast till the burger buns are golden brown and crisp.Take a cooked patty, spoon two tablespoon of the sauce on top, place a cheese slice over it and microwave the patty for just 10 seconds until you see the cheese melt.Take the patty out, spread some of the sauce on the base of the burger bun and place the patty with cheese on top and add few slices of jalapeno and close it with the burger top and serve. Do the same for the rest of the burger.Serve the Veg Chili Cheese Burgers Recipe along with baby potato stir fry and Mango Iced Tea Recipe to make it a complete meal.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/12-Veg_Chili_Cheese_Burger.jpeg"
},
{
    "Id": 13,
    "RecipeName": "Andhra Steel Ingavu Charu - Asfoitida Flavored Tamarand Rasam",
    "Ingredients": "2 cup Tamarind Water,1/2 cup Arhar dal (Split Toor Dal),1 teaspoon Asafoetida (hing),Salt - to taste,1 teaspoon Mustard seeds,1 teaspoon Cumin seeds (Jeera),1 teaspoon Methi Seeds (Fenugreek Seeds),1 sprig Curry leaves,1 pinch Asafoetida (hing),Sunflower Oil - for cooking",
    "PrepTime": 0,
    "CookTime": 30,
    "TotalTime": 30,
    "Servings": 4,
    "Cuisine": "Andhra",
    "Course": "Lunch",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Andhra Style Ingavu Chaaru Recipe pressure cook the tamarind water with toor dal, hing and salt for about 4 whistles. Turn off the flame and allow the pressure to release naturally. Open the lif of the cooker and thoroughly mash the dal and bring the whole mixture together by mixing it well. To temper, heat a kadai with oil, add mustard seeds, cumin seeds, fenugreek seeds and allow it to crackle.Add curry leaves, pinch of hing and leave it for 2 seconds and pour it over the rasam. Serve the Andhra Style Ingavu Chaaru Recipe along with steamed rice and Gorikayi Palya Recipe  as a comforting meal during your week day.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/13-Ingavu_Chaaru.jpeg"
},
{
    "Id": 14,
    "RecipeName": "Oreo Milkshake",
    "Ingredients": "8 Oreo biscuits - broken into pieces,1/2 cup Vanilla Ice cream - 2 scoops,1/4 cup Milk,1 tablespoon Chocolate sauce,Chocolate sauce - as required for garnishing,Heavy whipping cream - as required for garnishing",
    "PrepTime": 10,
    "CookTime": 15,
    "TotalTime": 25,
    "Servings": 2,
    "Cuisine": "Continental",
    "Course": "Snack",
    "Diet": "Vegetarian",
    "Instructions": "To begin making Oreo Milkshake Recipe prep up to make Oreo milkshake with all the ingredients mentioned. Take a powerful hand blender to blend everything.Blend Oreo biscuits, milk, ice cream and chocolate syrup until everything very well combined and smooth textured.Pour into glasses, top it up with some whipped cream and chocolate syrup for garnishing and serve immediately.Serve Oreo Milkshake along With Grilled Mushroom Sandwich to kids for their after school snacks.\n",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/14-Oreo_Milkshake_Recipe.jpeg"
},
{
    "Id": 15,
    "RecipeName": "Saunf Aloo (Fennel Potato Curry)",
    "Ingredients": "5 Potatoes (Aloo) - halved with skin,2 teaspoon Fennel seeds (Saunf) - crushed,2 teaspoon Red Chilli powder,1 teaspoon Turmeric powder (Haldi),1/4 cup Fresh cream - or 1/2 cup milk,4 sprig Coriander (Dhania) Leaves - finely chopped",
    "PrepTime": 10,
    "CookTime": 15,
    "TotalTime": 25,
    "Servings": 6,
    "Cuisine": "Punjabi",
    "Course": "Lunch",
    "Diet": "Vegetarian",
    "Instructions": "To begin with Saunf Aloo, heat oil in a pressure cooker. Add turmeric powder, salt, red chilli powder and crushed fennel seeds till the fennel seeds turns golden in colour.Now add the potatoes and mix it properly with the masala. Sauce it for 2-3 minutes and then add enough water to cover the potatoes in the cooker.Switch the heat after two whistles and once the pressure is released, open the lid of the pressure cooker.The next step is to add the cream or milk and mash a few potatoes to get a thicker consistency. Let it cook for 5 more minutes or until the cooker releases 2 more whistles.Garnish the Saunf Aloo with some roasted saunf and chopped coriander. Serve Sauf Aloo along with Amritsari Dal and Whole Wheat lachha Paratha for a weekday meal.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/15-Saunf_Aloo.jpeg"
},
{
    "Id": 16,
    "RecipeName": "South Indian Onion Chutney - South Indian Onion Chutney",
    "Ingredients": "2 onions, 1 teaspoon cumin seeds, 2 tablespoons black urad dal (split), 1 tablespoon tamarind paste, 3 dry red chillies, 1/2 teaspoon jaggery, 2 teaspoons oil, salt - 1 teaspoon, as per taste Rye, 1 sprig curry leaves, 1/2 teaspoon oil",
    "PrepTime": 20,
    "CookTime": 20,
    "TotalTime": 40,
    "Servings": 4,
    "Cuisine": "South Indian Recipes",
    "Course": "Side Dish",
    "Diet": "Vegetarian",
    "Instructions": "To make South Indian Onion Chutney, first of all chop the onion and keep it aside. Now heat 1 teaspoon of oil in the pan. Add cumin seeds, dry red chillies and let it cook for 10 seconds. Now add urad dal in it and let it cook till it becomes golden. Turn off the gas and drain in a bowl. Add another spoon of oil to the same pan. Add onions and let it cook for 4 to 5 minutes. Turn off the gas and let it cool down. Now put urad dal, cumin and dry red chillies in the mixer grinder and grind them. Add cooked onions, tamarind and jaggery. Add some water and grind it. Now for the tempering, heat the oil in a small pan. Add mustard seeds and curry leaves. After 10 seconds, add it to the chutney and mix. Serve South Indian onion chutney with masala dosa or ghee dosa for a tsunag breakfast.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/16-Onion_Chutney.jpeg"
},
{
    "Id": 17,
    "RecipeName": "Hariyali Egg Curry In Coriander and Mint Gravy",
    "Ingredients": "4 Whole Eggs - boiled,1 Cinnamon Stick (Dalchini) - small,1 Bay leaf (tej patta),2 Cloves (Laung),1 tablespoon Sunflower Oil,2 teaspoons Coriander Powder (Dhania),1 teaspoon Garam masala powder,2 tablespoons Fresh cream,2 cups Coriander (Dhania) Leaves - tightly packed,1 cup Mint Leaves (Pudina) - chopped,2 Green Chillies - chopped,1 Onion - roughly chopped,1 inch Ginger - chopped,4 cloves Garlic",
    "PrepTime": 15,
    "CookTime": 20,
    "TotalTime": 35,
    "Servings": 4,
    "Cuisine": "Indian",
    "Course": "Lunch",
    "Diet": "Eggetarian",
    "Instructions": "To begin making the Hariyali Egg Curry recipe, we will first make the Hariyali Masala.Into the Mixer Grinder (medium jar), add the Coriander leaves mint leaves, Green Chillies and 1/2 cup water. Blend all of them together to make a smooth paste and keep aside.Into the small jar of the mixer grinder, add the onions, ginger and garlic and grind to make a paste. Heat 1 tablespoon oil in a kadai over medium heat, add the Bay leaf (tej patta), Cloves, Cinnamon Stick and roast for a few seconds. Add the Onion ginger garlic paste.Saute for 4 to 5 minutes until raw onion smell goes away.Once the onions are roasted, add garam masala powder, coriander powder and saute for a few seconds.Add the Hariyali Coriander Mint Mixture, the fresh cream and the 4 Boiled eggs.Add water if required to adjust the consistency of the Hariyali Egg Curry.  Cover & simmer the Hariyali Egg Curry for 5 minutes.Check the salt and spices and adjust to according to your taste and transfer the Hariyali Egg Curry into a serving bowl. Serve the Hariyali Egg Curry along with Malabar Parotta or  Whole Wheat Lachha Paratha and Burani Raita for a weeknight dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/17-Hariyali_Egg_Curry.jpeg"
},
{
    "Id": 18,
    "RecipeName": "Gourd Raita - Grated Bottle Gourd Yogurt Salad",
    "Ingredients": "2 cups curd, 1 cup gourd - peel and tighten, 1 cucumber - peel and grind, 1 green - finely chopped, 1 green coriander - little, 1/2 teaspoon cumin powder, salt - as per taste",
    "PrepTime": 15,
    "CookTime": 15,
    "TotalTime": 30,
    "Servings": 4,
    "Cuisine": "Indian",
    "Course": "Side Dish",
    "Diet": "Vegetarian",
    "Instructions": "To prepare gourd raita, prepare all the ingredients first. Add grated gourd, cucumber, curd, green chillies, salt, cumin powder and coriander in a large bowl. Mix well and your raita is ready. Serve gourd raita with Garlic Dal, gourd elder greens and phulka for dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/18-Grated_Bottle_Gourd_Yogurt_Salad.jpeg"
},
{
    "Id": 19,
    "RecipeName": "Homemade Tater Tots",
    "Ingredients": "10 Potatoes (Aloo),1 teaspoon Garlic powder,1 teaspoon Onion powder,1 teaspoon Dried oregano,1 tablespoon Coriander (Dhania) Leaves - finely chopped,1 teaspoon Red Chilli flakes,2 tablespoon All Purpose Flour (Maida),1 tablespoon Rice flour,Salt - to taste,Sunflower Oil - for deep frying the tater tots",
    "PrepTime": 15,
    "CookTime": 45,
    "TotalTime": 60,
    "Servings": 8,
    "Cuisine": "Continental",
    "Course": "Appetizer",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Homemade Tater Tots Recipe, scrub potatoes thoroughly and wash them until clean. Peel the skin of the potatoes and we will not parboil the potatoes in hot water. In a large saucepan, add the potatoes and boil it brisk for about 5 to 7 minutes. After 5 to 7 minutes the potatoes would have boiled through slightly, but firm.Once boiled, water the potatoes until cold water and pat dry. This process will cool the potatoes a little. Once slightly cooled, grate the potatoes into a large mixing bowl. Add the garlic powder, onion powder, dried oregano, red chili flakes, fresh coriander leaves, salt to taste, all purpose flour, rice flour and mix well to form a dough like consistency.The next step is to shape the potatoes and deep fry the tater tots. Grease your fingers and palm with oil and shape the potatoes into bite size ovals (cylinders).Heat oil in a pan for deep frying over medium heat. Carefully drop each one of the shaped Tater Tots in oil and fry them on medium heat until golden brown on all sides.Once done, remove the Tater Tots from the oil and place it on kitchen paper towels to absorb the excess oil.Serve the Tater Tots with tomato ketchup or a Sichuan Style Bird Eye Chili Sauce as a tea time snack or as an appetizer for parties.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/19-Homemade_Tater_Tots.jpeg"
},
{
    "Id": 20,
    "RecipeName": "Chettinad Vegetable Casserole - Chettinad Vegetable Pulao",
    "Ingredients": "1 cup rice - wash well in water, 12 small onions - finely chopped, 2 cloves garlic - tighten, 1 inch ginger - tighten, 2 green chillies - straight and thin cut, 1 bay leaf - break , 1 tsp red chilli powder, 1 tsp turmeric powder, 1 carrot - chop, 12 green beans - chop, 2 potatoes - peel and chop, ghee - as per use, 2 cloves, 1 inch cinnamon, 1 tsp fennel , 1 tsp whole pepper, 1 tsp coriander seeds, 1/4 cup green peas - steam, 1/4 cup mint leaves - finely chopped",
    "PrepTime": 15,
    "CookTime": 45,
    "TotalTime": 60,
    "Servings": 4,
    "Cuisine": "Chettinad",
    "Course": "Dinner",
    "Diet": "Vegetarian",
    "Instructions": "To make Chettinad vegetable casserole, first cut all the vegetables. Soak rice for 30 minutes. Heat a pan on gas. Add long, cinnamon, fennel, whole black pepper, coriander seeds, and roast for 2 to 3 minutes. Turn off the gas and allow this spice mixture to cool. After it cools down, put it in a blender and grind it. Keep it aside. Now heat ghee in a pan. Add ginger, garlic, onion, green chilies and cook till the onion becomes soft. After the onion becomes soft, add carrots, green beans, potatoes, bay leaves, turmeric powder, red chilli powder, ground spices and mix well. After 2 minutes, add rice, salt, 2 cups of water and let it boil. After boiling, reduce the heat, cover the pan and cook until the rice is cooked. If the rice remains raw, then add some more water and cook it. After cooking, turn off the gas, cover and keep it aside for 10 minutes. Serve. Serve Chettinad Vegetable Casserole Recipe along with Bundi Raita and Baked Papad for dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/20-Chettinad_Vegetable_Pulao.jpeg"
},
{
    "Id": 21,
    "RecipeName": "Garlic Amla Chutney - Lehsun Amla Chutney",
    "Ingredients": "8 amla, 6 small onions, 10 bud garlic, 2 green chillies, 1/2 cup mint, 1/2 cup coriander, salt - as per taste, 1 tsp oil, 1 tsp oil, 1/2 tsp rye, 1/4 tsp urad dal, 1/4 tsp chana dal, 1 sprig curry leaves, 10 cashew nuts",
    "PrepTime": 5,
    "CookTime": 10,
    "TotalTime": 15,
    "Servings": 3,
    "Cuisine": "Tamil Nadu",
    "Course": "Side Dish",
    "Diet": "Vegetarian",
    "Instructions": "To make Garlic Amla Chutney Recipe, first wash the amla, cut and remove the seeds. Now wash the mint, green coriander and keep it aside. Now heat oil in a pan. Add small onion, garlic and cook the onion after it becomes soft. Now add amla, mint, green coriander and cook it for 2 minutes. Turn off the gas. Allow this mixture to cool. Pour this mixture in the mixer grinder with salt, a little water and make a paste. Keep it separately. For tempering, now heat oil in a tempering pan. Add the mustard seeds, chana dal, urad dal, curry leaves, cashews and cook until cashew is light brown. Add this tempering to the chutney and mix. Mix well and serve. Serve Garlic Amla Chutney Recipe with Ghee Roast Dosa and Filter Coffee for breakfast.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/21-Lehsun_Amla_Chutney.jpeg"
},
{
    "Id": 22,
    "RecipeName": "Maharashtrian Kakdi Thalipeeth - Spiced Cucumber Flat Bread",
    "Ingredients": "1/2 cup Gram flour (besan),1/2 cup Whole Wheat Flour,1/4 cup Rice flour,1 Cucumber - peeled and grated,1 teaspoon Turmeric powder (Haldi),1 teaspoon Cumin powder (Jeera),1 teaspoon Coriander Powder (Dhania),1 teaspoon Red Chilli powder,2 Green Chillies - finely chopped,1/2 cup Coriander (Dhania) Leaves - chopped,5 cloves Garlic - finely chopped,Salt - to taste,Ghee - for smearing on thalipeeth",
    "PrepTime": 30,
    "CookTime": 30,
    "TotalTime": 60,
    "Servings": 4,
    "Cuisine": "Maharashtrian Recipes",
    "Course": "Indian Breakfast",
    "Diet": "Diabetic Friendly",
    "Instructions": "To begin making the Maharashtrian Kakdi Thalipeeth Recipe, in a large mixing bowl add all the 3 flours together and mix them. Add all the remaining ingredients like the grated cucumber, turmeric powder, cumin powder, coriander powder, red chili powder, green chillies, coriander leaves, garlic and salt to taste.Mix everything well and add a little water at a time to make a smooth and firm dough of the Kakdi Thalipeeth. The cucumber will release water when it gets combined with salt, so take care to add little water at a time. The dough will be slightly sticky to handle. Allow the dough to rest for 5 minutes. Divide the dough into 4 portions. Preheat the skillet on medium heat. Keep water in a separate bowl to wet fingers and to wet a muslin cloth.Spread a wet muslin cloth on a smooth counter top. Take a portion of the Kakdi Thalipeeth mixture and pat it on the wet cloth to about 4 inches in diameter. Try not to make it too thin as it can break while flipping it on the skillet.Carefully lift the cloth along with the patted mixture and flip the Thalipeeth over on the skillet. Drizzle a teaspoon of oil or ghee around the Thalipeeth and cook on medium heat.After about 3 minutes, you will be able to flip the Kakdi Thalipeeth over to the other side. Allow each side to cook on medium heat for about 3-4 minutes, until the Thalipeeth are slightly crisp and browned. Remove from heat and place on a serving platter.Continue the same procedure with the other portions of the Kakdi Thalipeeth dough.Serve the Maharashtrian Kakdi Thalipeeth along with Homemade Yogurt or lahsun chutney for breakfast.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/22-Kakdi_Thalipeeth_Recipe.jpeg"
},
{
    "Id": 23,
    "RecipeName": "Homemade Healthy Subway Sandwich With Beet & Sprout",
    "Ingredients": "2 Submarine Bread (Subway Bread) - (flat breads or foot longs),1/2 cup Green Moong Sprouts,1 Beetroot - grated,2 cloves Garlic - grated,1/2 cup Hung Curd (Greek Yogurt),2 tablespoon Coriander (Dhania) Leaves - finely chopped,2 Tomatoes - thinly sliced,2 Stalks Spring Onion (Bulb & Greens) - finely chopped,Tabasco Original - Hot Sauce - to taste,Salt and Pepper - to taste",
    "PrepTime": 15,
    "CookTime": 15,
    "TotalTime": 30,
    "Servings": 4,
    "Cuisine": "Fusion",
    "Course": "Dinner",
    "Diet": "High Protein Vegetarian",
    "Instructions": "To begin making Subway Sandwich Recipe With Roasted Beetroot, we will first cook the beets.Heat a teaspoon of oil in a wok; add the grated beets and garlic, sprinkle some salt and stir fry on low to medium heat until the beets are softened and cooked.Once you notice the beetroot is cooked through, turn off the heat and allow it to cool completely.Once the beetroot has cooled completely, add it to a large mixing bowl. To this add in the greek yogurt/ hung curd, coriander leaves, spring onions along with salt and pepper to taste. Give the mixture a good stir. Keep this aside.In the next step toast the subway bread or the foot long along with butter in a skillet until lightly warmed and crisp. You can use butter or olive oil for toasting. Make sure you cut them into half and then toast.Once once, the next step is to layer the Subway Sandwich With Roasted Beetroot.Place the cut and toasted subway bread on a flat surface.Spread the beetroot mixture on one half of the sandwich, scatter the sliced tomatoes, the green moong sprouts and drizzle some tabasco sauce for a punch. Now cover the Subway Sandwich With Roasted Beetroot by pressing it down with the other half and serve.Serve the Subway Sandwich Recipe With Roasted Beetroot for a wholesome weeknight dinner or even as an after school snack for your kids along with a Apple Almond Date Smoothie. You can also pack this sandwich into an office lunchbox.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/23-Subway_Sandwich.jpeg"
},
{
    "Id": 24,
    "RecipeName": "South Indian Style Murungakkai Poriyal - Drumstick Stir Fry",
    "Ingredients": "5 Drumstick - cut into 3 inch pieces,1/2 cup Fresh coconut - grated,2 Green Chillies - slit,1 sprig Curry leaves,1 teaspoon Mustard seeds,2 teaspoons Coconut Oil,2 Dry Red Chillies,1/2 teaspoon Turmeric powder (Haldi),Salt - to taste,Water - as needed",
    "PrepTime": 30,
    "CookTime": 15,
    "TotalTime": 45,
    "Servings": 4,
    "Cuisine": "South Indian Recipes",
    "Course": "Side Dish",
    "Diet": "Vegetarian",
    "Instructions": "To begin making Murungakkai Poriyal Recipe, wash the drumsticks well & peel them by removing the tough green part. Cut them in 2 inches length.Take about glass of water in a kadhi, bring it to a boil, add these drumsticks with salt, turmeric powder (optional) & lightly steam them for 5-8 minutes. Be careful not to overcook the drumsticks. It should be tender but not mushy as in sambar or avial.Drain the water, keep the steamed drumsticks aside to cool slightly.Grate the coconut, add the green chillies & grind them well in a mixer.In the kadai, add coconut oil, once hot, add the mustard seeds, let it crackle.Then add the dry red chillies, curry leaves & add the steamed drumsticks.Mix everything well & let it cook for a minute. Add the grated coconut & give it one last stir.Serve Murungakkai Poriyal Recipe along with Kerala Avial Recipe, Steamed Rice Recipe and Malabar Style Dates Pickle Recipe for a complete meal.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/24-Murungakkai_Poriyal.jpeg"
},
{
    "Id": 25,
    "RecipeName": "Kesar Mango Lassi - Saffron Mango Lassi",
    "Ingredients": "3/4 cup Mango Pulp (Puree),1 cup Curd (Dahi / Yogurt) - (low fat),1 tablespoon Sugar - or honey,2 pinch Saffron strands,3 tablespoons Badam (Almond) - roughly chopped,3 tablespoons Milk - luke warm+more cold milk as needed,Ice cubes - a few",
    "PrepTime": 15,
    "CookTime": 10,
    "TotalTime": 25,
    "Servings": 2,
    "Cuisine": "Indian",
    "Course": "Snack",
    "Diet": "Vegetarian",
    "Instructions": "To begin making Kesar Mango Lassi Recipe, soak one pinch kesar in 2 tablespoons warm milk and keep it aside for few minutes.Get prep with other ingredients as well. Take out the pulp from the mangoes and keep aside.In a blender, add mango pulp, curd/yogurt, cold milk and blend till combined.Once it is done, add chopped almonds (2 tablespoons), honey or sugar, some ice cubes and blend to make the Kesar Mango Lassi Recipe.Kesar Mango Lassi Recipe is ready to serve, garnish it with the rest of chopped almonds and saffron and serve with Bhel Puri Recipe or Asian Watermelon Salad Recipe during evening.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/25-Kesar_Mango_Lassi.jpeg"
},
{
    "Id": 26,
    "RecipeName": "Chettinad Sweet Paniyaram Recipe - Chettinad Sweet Paniyaram Recipe",
    "Ingredients": "1 cup idli dosa mixture, 4 tablespoons rice rava, 1/3 cup jaggery, 3 tablespoons coconut - grated, 1 tablespoon of cardamom powder, salt - as per taste, water - as per use, oil - as per use",
    "PrepTime": 5,
    "CookTime": 20,
    "TotalTime": 25,
    "Servings": 10,
    "Cuisine": "Chettinad",
    "Course": "Snack",
    "Diet": "Vegetarian",
    "Instructions": "To make the Chettinad sweet paniyaram recipe, firstly mix and mix idli dosa mixture, rice rava, jaggery, coconut, salt, elaichi powder, some water in a mixing bowl. Keep aside for 5 minutes and mix again. Heat the paniyaram pan and add some oil to each hole. After heating, add the mixture to it and cover it. Cook on low heat. Once cooked from one side, flip it and cook from the other side. Cook on both sides until golden. Remove from pan and serve. Serve the Chettinad Sweet Paniyaram Recipe with Masala Tea or Filter Coffee for an evening snack.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/26-Sweet_Paniyaram.jpeg"
},
{
    "Id": 27,
    "RecipeName": "Mini Dal Samosa Curry / Sabzi",
    "Ingredients": "3 Cardamom (Elaichi) Pods/Seeds,6 Whole Black Peppercorns,1/2 inch Cinnamon Stick (Dalchini),3 cloves Cloves (Laung),1 Mace (Javitri),1 Bay leaf (tej patta),1 Black cardamom (Badi Elaichi),1/2 teaspoon Kasuri Methi (Dried Fenugreek Leaves),1/2 teaspoon Kashmiri Red Chilli Powder,1/2 teaspoon Turmeric powder (Haldi),1 teaspoon Coriander Powder (Dhania),1/2 teaspoon Garam masala powder,6 Samosas - mini,15 Cashew nuts,1 Green Chilli,1 Onion - roughly chopped,2 Tomato - roughly chopped,1/2 inch Ginger,1/2 teaspoon Sugar,1 tablespoon Fresh cream,2 tablespoons Sunflower Oil",
    "PrepTime": 5,
    "CookTime": 30,
    "TotalTime": 35,
    "Servings": 3,
    "Cuisine": "North Indian Recipes",
    "Course": "Lunch",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Mini Dal Samosa Gravy Recipe, we need to first prepare the gravy. In a heavy bottomed pan, add 1 tablespoon of cooking oil and heat it on a medium flame. Once the oil is hot, add Cardamom, Black Pepper, Cloves, Cinnamon, Javitri and saute for few seconds. Next add cashew nuts, green chilli, ginger, chopped onion and tomatoes. Mix well and add 1/2 cup water and Salt (as per your taste)Cover the pan and boil this mixture until the onions and tomato become soft. Turn off the flame and let this mixture cool. Once the mixture is cool, add it to a mixer and blend until smooth. Strain the paste to remove any big chunk of ingredients (optional to give fineness to gravy). Keep aside. In the same heavy bottomed pan, heat one tablespoons of oil and add bay leaf, black cardamom. Once the spices release the aromas add in the ground tomato and onion mixture, add Kashmiri Red Chilli powder, Turmeric powder, Coriander powder, Garam Masala and the crushed Kasuri Methi.Mix well and cook for 10 mins at low flame. Add fresh cream and sugar and stir it well into the gravy. Simmer for a few more minutes and add the mini Samosas in the gravy. Turn off the flame.Make sure to add the mini dal samosas to the gravy only one hour before serving, else the samosa will get completely soggy. To make mini dal samosas at home follow Moong Dal Mini Samosas.Serve Mini Dal Samosa Curry Recipe along with hot Phulka, Tawa Paratha or Jeera Rice and Kachumber Salad Recipe With Cucumber, Onion & Tomatoes for a sumptuous Sunday meal",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/27-Mini_Dal_Samosa_Curry.jpeg"
},
{
    "Id": 28,
    "RecipeName": "Spinach Garlic Bruschetta With Red Bell Pepper Sauce",
    "Ingredients": "1 Baguette - sliced,1 1/2 tablespoon Butter,1/2 tablespoon Garlic - minced,1 cup Spinach Leaves (Palak),1 Red Bell pepper (Capsicum) - (optional,1 Tomato - finely chopped,1 Onion - finely chopped (optional),1 tablespoon Black pepper powder - adjust,1 tablespoon Italian seasoning,1 teaspoon Fresh cream,1 cup Cheddar cheese - grated,Salt - to taste,1 tablespoon Roasted tomato pasta sauce",
    "PrepTime": 10,
    "CookTime": 20,
    "TotalTime": 30,
    "Servings": 4,
    "Cuisine": "Italian Recipes",
    "Course": "Appetizer",
    "Diet": "Vegetarian",
    "Instructions": "To prepare Spinach Garlic Bruschetta Recipe With Red Bell Pepper Sauce, prepare garlic flavoured butter first. Mix the garlic extract through cutting and folding method into butter at room temperature until well mixed.Slice the bread to about an inch thick, apply garlic butter, and grill them for 6-10 minutes in a preheated oven at 180 degrees C. You can even roast it on the stove if you don't have an oven. Blanch spinach leaves in the microwave for 4-5 minutes and chop roughly.Meanwhile, Red bell pepper sauce can be prepared.In pan, mix chopped bell peppers, onions, salt, pepper roasted tomato sauce and Italian seasoning with butter and cook till mushy.Add fresh cream at the till and saute till thick and creamy. Set the red bell pepper sauce aside to cool.spread the blanched spinach on the grilled baguette bread, spoon the chopped tomatoes on it, add cheese and bake again for 5 minutes in the pre-heated oven at 180 degrees C.Once the sauce is cooled, serve Spinach Garlic Bruschetta Recipe With freshly prepared Red Bell Pepper Sauce recipe. Couple it with Roasted Cherry Tomato Soup Recipe or your choice of soup and salad like Potato And Cucumber Salad Recipe for light dinner.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/28-Garlic_Bruschetta.jpeg"
},
{
    "Id": 29,
    "RecipeName": "Mini Dal Mature Chat - That Perfect Party Snack",
    "Ingredients": "1 cup Whole Wheat Flour,1 cup All Purpose Flour (Maida),1 teaspoon Ajwain (Carom seeds),1 teaspoon Cumin seeds (Jeera),2 tablespoons Ghee,Salt - as needed,Sunflower Oil - for deep frying,1 cup Chana dal (Bengal Gram Dal),1/2 teaspoon Turmeric powder (Haldi),1/2 teaspoon Garam masala powder,1/4 teaspoon Red Chilli powder,1 teaspoon Amchur (Dry Mango Powder),1/2 teaspoon Sugar,Salt - as needed,1 tablespoon Ghee,1/4 teaspoon Asafoetida (hing),1 teaspoon Cumin seeds (Jeera),2 Green Chillies - slit,1 sprig Curry leaves,1/4 cup Sweet Chutney (Date & Tamarind),1/4 cup Green Chutney (Coriander & Mint),1 Onion - finely chopped,1/2 cup Fresh Pomegranate Fruit Kernels,1/4 cup Sev",
    "PrepTime": 20,
    "CookTime": 45,
    "TotalTime": 65,
    "Servings": 30,
    "Cuisine": "Sindhi",
    "Course": "Appetizer",
    "Diet": "Vegetarian",
    "Instructions": "To begin making the Dal Pakwan Chaat, we will first make the Pakwan and keep it ready.Sift both the flours together. Add ajwain, cumin, salt and ghee and mix all together into the flour. Knead the flour into a smooth dough adding water little at a time. Preheat the oil for deep frying.Divide the Pakwan dough into equal lemon size portions.Dust the surface with flour and roll the pakwan dough into a small disc.Use a fork and mark impressions on the rolled pakwan. Pierce from both sides, this will prevent the pakwan from puffing up.Place the pakwans into the preheated oil and deep fry on low to medium heat until golden brown and crisp on both sides. Transfer the fried pakwan on a kitchen paper towels to drain the excess oil and store in airtight containers.Next step is to make the Dal for the Pakwan Chaat. Wash and soak chana dal in water overnight or for at least 4 hours.Once soaked, drain the water and cook the chana dal in 2 cups of water in the pressure cooker for a couple of whistles along with salt, sugar, turmeric powder, garam masala and amchur powder.After a 4 to 5 whistles, turn the heat to low and simmer for another 5 minutes and turn off the heat. Allow the pressure to release naturally. The grains of the chana dal should be soft and yet separate.Open the lid once the pressure releases completely.In a small tadka pan, heat ghee over medium heat. Add the cumin and green chilies.Saute for a few seconds, add the curry leaves and asafoetida and turn off the heat.Pour the seasoning over the Sindhi Chana Dal and give it a stir.To make the Mini Dal Pakwan ChaatWhen you are ready to serve, place the Pakwan (the crisp puri) on serving platters. Spoon a small portion of the dal over each of the pakwan (crisp puri).Drizzle some date chutney and green chutney and finally top with with some chopped onions and pomegranates, sev and serve.These Mini Dal Pakwan Chaat make great appetizers at parties, you can even serve it this was for a delicious weekend breakfast as well.Serve these Mini Dal Pakwan Chaat as an evening snack or as an appetizer for parties along with Pav Bhaji, Dahi Vada, Pani Puri and finally end it with a Paneer Kheer as a dessert.",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/29-Mini_Dal_Pakwan_Chaat.jpeg"
},
{
    "Id": 30,
    "RecipeName": "Asian Style Sweet & Spicy Green Beans",
    "Ingredients": "300 grams Green beans (French Beans) - cut into half,3 cloves Garlic - finely chopped,1 tablespoon Soy sauce,2 tablespoons Thai Sweet Chilli Sauce,1 Lemon - juice,2 tablespoons Rice Wine Vinegar,1/4 cup Roasted Peanuts (Moongphali),Salt - to taste,1 tablespoon Sesame (Gingelly) Oil",
    "PrepTime": 10,
    "CookTime": 15,
    "TotalTime": 25,
    "Servings": 4,
    "Cuisine": "Thai",
    "Course": "Side Dish",
    "Diet": "High Protein Vegetarian",
    "Instructions": "To begin making the Asian Style Sweet & Spicy Green Beans Recipe, firstly add the green beans into a pressure cooker with salt to taste and 2 tablespoons of water.Pressure cook the beans for one whistle and release the pressure immediately and keep aside. We release the pressure immediately, so the greens remain green and fresh,Our next step is to stir fry the green beans in Asian sauces.Preheat heat oil in a pan over medium heat; once the oil is hot add the cloves and saute for a few seconds until the aromas come through. At this stage, add the soy sauce, thai sweet chilli sauce, rice wine vinegar, and lemon juice and stir to combine. Add the cooked beans and roasted peanuts to the above sauce mixture.Stir fry on high heat for 3 to 4 minutes till the beans and the peanuts are well coated with the sweet and spicy sauce.Once done, check the salt and spices and adjust to taste accordingly. Once done, turn off the heat and transfer the Asian Style Sweet & Spicy Green Beans to a serving bowl and serve hot.Serve Asian Style Sweet & Spicy Green Beans Recipe with steaming hot Thai Jasmine Sticky Rice and Thai Pineapple Vegetarian Curry for a delicious meal.  ",
    "ImageURL": "https://s3.ap-south-1.amazonaws.com/saion9.com/images/30-Green_Beans.jpeg"
}
]